Revit 2024 API
BuiltInFailures.DividedSurfaceFailures.DividedSurfaceSplitManagerProblem1dNonWPCurve Property
 Divided Surface cannot be split by a one dimensional curve without workplane
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId DividedSurfaceSplitManagerProblem1dNonWPCurve { get; }
Visual Basic
Public Shared ReadOnly Property DividedSurfaceSplitManagerProblem1dNonWPCurve As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ DividedSurfaceSplitManagerProblem1dNonWPCurve {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.DividedSurfaceFailures Class
Autodesk.Revit.DB Namespace